{"Lesson":5,"LessonElements":[{"LessonImageFilePath":"","LessonText":"U računalnoj animaciji cilj je ostvariti promjene prikaza naše scene u vremenu. Kretanjem objekata, kamere, promjenom boja ili bilo kojih parametara scene stvaramo privid stalnih promjena u vremenu.\n Računalna animacija s obzirom na način realizacije može se podijeliti na:\n -animaciju zadanu ključnim okvirima\n -animaciju koja je ostvarena uzorkovanjem kretnji stvarnih objekata ili MoCap (engl. Motion Capture)\n -fizikalno temeljenu animaciju, odnosno općenitije, animaciju određenu pravilima\n \nAnimacija ključnih okvira:\n\n Kod animacije ključnim okvirima ne uzimamo u obzir razne fizikalne parametre koji utječu na ponašanje objekta, već promatramo samo kako se objekt ponaša i pokušavamo to ponašanje oponašati našom animacijom. Animacija može biti:\n -kinosekvenca za igru (engl. Cinematics, pr. Animirani filmovi u 2D i 2.5D igrama)\n -animirana sekvenca pokreta koja se ciklički ponavlja (pr. Hodanje 3D modela)\n Ključni okviri mogu sadržavati podatke o položaju, orijentaciji, skali objekta, položaju skeleta, boji, svojstvima materijala, prozirnosti i raznim drugim parametrima određenim za diskretne vremenske trenutke. Program sam animira ostale okvire između ključnih okvira.\n Za rad s ključnim okvirima tipična su tri uređivača:\n  -vremenska linija (engl. Time Line )\n  -list snimanja (engl. Dope Sheet )\n  -uređivač grafova (engl. Graph Editor )\n  \nVremenska linija:\n\n Vremenska linija je najjednostavniji od ova tri uređivača. Najvažniji dio je prikaza okvira (engl. Frames) na kojem su prikazani svi do sada označeni ključni okviri i pokazivač na trenutni okvir. Ključni okvir se zadaje nakon što smo odabrali jedan ili više parametara od kojih se najčešće koristi pozicija, rotacija i skala objekta.\n Automatsko snimanje ključnih okvira automatski popunjava ostale okvire između ključnih okvira koje smo zadali u vremenskoj liniji. Pokretanjem animacije možemo vidjeti kako su se animirali ostali okviri.\n Uobičajeno je da je gibanje objekata glatko, odnosno da objekti ne mijenjaju naglo smjer pa je inicijalni, odnosno početno zadani način gibanja (engl. Default) Bézierovom krivuljom. Promjene u ključnim okvirima upravljaju se načinom rukovanja (engl. Handle Type) u ključnim okvirima.\nU animiranoj sekvenci obično možemo dodati i oznake, odnosno markere (engl. Marker) koje kasnije možemo koristiti kao okidače za  pokretanje čestičnog sustava ili nekog drugog događaja, ili vizualnog učinka.\n Ako je scena vrlo složena za prikaz i računalo ne može u realnom vremenu prikazivati ostvarenu animaciju, broj slika u sekundi „fps“ (engl. Frame per Second) može postati problematičan, odnosno animacija će u tom slučaju biti usporena. U uređivačima za uređivanje ključnih okvira tada moramo odabrati za prikaz odbacivanje okvira (engl. Frame Dropping) kako bi se animacija prikazivala u stvarnom vremenu.\n  "},{"LessonImageFilePath":"lek1","LessonText":"\nList snimanja:\n\nList snimanja (engl. Dope Sheet)  za razliku od vremenske linije, nudi detaljniji uvid u ključne okvire i omogućava prikaz animiranih sekvenci više objekata scene. U listu snimanja možemo dobiti uvid u svaki pojedini kanal animacije (pozicija, rotacija i skaliranje po X, Y i Z osi).\nOdređivanje ponašanja objekta između dva ovira zove se interpolacija. Za interpolaciju između dva ključna okvira najčešće se koristi Bézierova krivulja (pr. Za kretnje čovjeka), no kada je to potrebno, odabrat ćemo linearnu  (pr. Za kretnje robota)  ili interpolaciju konstantom.\nKod animiranih pokreta najvažnije je istaknuti ekstreme, odnosno trenutke kada je nešto na najvišoj ili najnižoj poziciji U listu snimanja to su maksimalne i minimalne vrijednosti na krivuljama koje možemo sažeto prikazati malim oznakama.\n"},{"LessonImageFilePath":"lek2","LessonText":"\nUređivač grafova:\n\nNajdetaljniji uvid u ključne okvire, a posebno interpolaciju između pojedinih ključnih okvira dat će nam uređivač grafova. Uređivač grafova daje detaljan prikaz krivulja po kojima se obavlja interpolacija pojedinih parametara i najbolji je alat za fino oblikovanje pojedinih krivulja.\n"},{"LessonImageFilePath":"lek3","LessonText":"\nAnimacija ostvarena uzorkovanjem kretnji stvarnih objekata MoCap:\n\nKod uzorkovanje pokreta MoCap (engl. Motion Capture) stvarni pokreti ljudi ili životinja se uzorkuju na pokretima stvarih glumaca zbog njihove složenosti. Oprema, odnosno tehnologija snimanja dijeli se na onu koja koristi markere i snimanje bez markera. Markeri su oznake koje se postavljaju na glumca, obično na zglobove i istaknute točke kako bi se što preciznije snimili pokreti. Za snimanje je potreban i veliki broj kamera zato što markeri često mogu biti zaklonjeni drugim objektom ili glumcem. Veliki broj kamera omogućava da svaki marker bude vidljiv za barem nekoliko kamera kako ne bismo izgubili njegovo praćenje.\nMoCap oprema zahtjevna je i za početno postavljanje i kalibraciju. Kalibracija znači da treba svaku kameru postaviti i uskladiti kako bi bila poznata njezina pozicija te kako je usmjerena u koordinatnom sustavu snimanja. Prilikom snimanja treba još pripaziti da objekti nemaju visokoreflektirajuće (ogledala i metale) površine jer mogu uzrokovati greške pri snimanju.\nZa svaki marker snimljeni pokreti se  kloniraju na virtualne modele, odnosno njihove armature. Snimljene sekvence u uređivaču grafova obično treba pročistiti od eventualnih grešaka.\n"},{"LessonImageFilePath":"lek4","LessonText":"\nAnimacija korištenjem fizikalne simulacije i pravilima:\n\nKod korištenja fizikalno temeljene simulacije važno je odrediti fizikalne parametre objekta i okoline. U igrama se vrlo često koristi fizikalni pogon koji implementira fizikalne simulacije.\nFizikalni parametri koji opisuju objekt, prije svega su masa objekta i razni parametri vezani uz materijal od kojega je načinjen objekt. Za fizikalno temeljenu simulaciju potrebno je znati početne uvjete kao što su pozicija, početna brzina i smjer kretanja objekta. Ovisno o objektima, u fizikalnom pogonu određeno je kako će učinci biti podržani, na primjer hoće li uzeti u obzir trenje, težinu objekta i slično.\nAnimacija određena pravilima ne koristi nužno fizikalne zakone. Na primjer, kod upravljanja kretanja pozadinskih likova u videoigrama, često se koriste razna pravila, odnosno umjetna inteligencija za upravljanje kretanja takvih objekata.\n"}]}